<?xml version="1.0" ?>
<net batch="1" name="saved_model" version="6">
	<layers>
		<layer id="0" name="input" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="norm/mul" precision="FP16" type="Eltwise">
			<data operation="mul"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="155_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="16"/>
			</blobs>
		</layer>
		<layer id="3" name="norm/Sum/Reshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8112</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="norm/Sum/Pool" precision="FP16" type="Pooling">
			<data exclude-pad="false" kernel="2,1" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8112</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="157_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="16" size="16"/>
			</blobs>
		</layer>
		<layer id="6" name="norm/Sum/FinalReshape" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8112</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="norm/Sum/FinalReshapePower/After/fused_power" precision="FP16" type="Power">
			<data power="0.5" scale="2.0" shift="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="AvgPool/Transpose_" precision="FP16" type="Permute">
			<data order="0,3,1,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="AvgPool" precision="FP16" type="Pooling">
			<data auto_pad="same_upper" exclude-pad="true" kernel="104,78" pads_begin="0,0" pads_end="0,0" pool-method="avg" strides="104,78"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>104</dim>
					<dim>78</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="AvgPool/Transpose_56" precision="FP16" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="1"/>
		<edge from-layer="1" from-port="2" to-layer="3" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="1"/>
		<edge from-layer="3" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-375-g332562022"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="True"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model_is_text value="False"/>
			<input_shape value="[1,104,78,2]"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[  1 104  78   2]"/>
			<reverse_input_channels value="False"/>
			<saved_model_dir value="DIR"/>
			<saved_model_tags value="['serve']"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, input_model, model_name, output, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
